##x = int(input("vvedite x = "))
##L = 0
##while x > 0:
##        L += 1
##        n = x % 10
##        x = x //10
##print(L)


##x = int(input())
##L = 0
##M = 0
##while x > 0:
##        L += 1     ## L = L + 1
##        if x % 2 == 0:
##                M = M + (x % 10) // 2
##        x = x // 10
##print(L)
##print(M)


##x = int(input())
##S = 0
##while x > 0:
##        n = x % 10
##        if n % 2 == 0:      
##                S = S + n
##        x = x //10  
##print(S)


##x = int(input())
##Max = -1000000000
##while x > 0:
##        n = x % 10
##        if n > Max:
##                Max = n
##        x = x //10  
##print(Max)


##x = int(input())
##k =0
##while x > 0:
##        n = x % 10
##        if n%2 == 0:
##                k = k +1
##        x = x //10  
##print(k)

##x = int(input())
##p = 1
##while x > 0:
##        n = x % 10
##        if n % 3 != 0:
##                p = p * n
##        x = x //10  
##print(p)

##################################30.10.21######################################

##x = 49**10+7**30-49
##k = 0
##while x > 0:
##    n = x % 7
##    if n == 6:
##        k = k + 1
##    x = x // 7
##print(k)


##x = int(input())
##for i in range(1, x + 1): ## генератор возможных делителей числа х
##    if x % i == 0: ## проверка явл. ли i дел х
##        print(i)

##x = int(input())
##for i in range(2, x): ## генератор возможных делителей числа х
##    if x % i == 0: ## проверка явл. ли i дел х
##        print(i)


##for x in range(10, 50 + 1):
##    print("делители числа ", x)
##    for i in range(2, x): ## генератор возможных делителей числа х
##        if x % i == 0: ## проверка явл. ли i дел х
##            print(i)


##x = int(input())
##k = 0
##for i in range(2, x): ## генератор возможных делителей числа х
##    if x % i == 0: ## проверка явл. ли i дел х
##        k = k + 1
########## поиск делителей завершен
##print(k)


##for x in range(10, 50 + 1):
##    k = 0
##    for i in range(2, x): ## генератор возможных делителей числа х
##        if x % i == 0: ## проверка явл. ли i дел х
##            k = k + 1
##    ########## поиск делителей для числа х завершен
##    if k == 2:
##        print(x)



##for x in range(10, 50 + 1):
##    k = 0
##    del1 = 0
##    del2 = 0
##    for i in range(2, x): ## генератор возможных делителей числа х
##        if x % i == 0: ## проверка явл. ли i дел х
##            k = k + 1
##            if k == 1:
##                del1 = i
##            if k == 2:
##                del2 = i
##    ########## поиск делителей для числа х завершен
##    if k == 2:
##        print(x,del1, del2)


##for x in range(174457, 174505 + 1):
##    k = 0
##    del1 = 0
##    del2 = 0
##    for i in range(2, x): ## генератор возможных делителей числа х
##        if x % i == 0: ## проверка явл. ли i дел х
##            k = k + 1
##            if k == 1:
##                del1 = i
##            if k == 2:
##                del2 = i
##    ########## поиск делителей для числа х завершен
##    if k == 2:
##        print(x,del1, del2)



#########################06.11.21##################################


###### 2х = 64

##for x in range(1,100):
##    if 2*x == 64:
##        print(x)

##for x in range(1,10000):
##    print(x)


##Определите, при каком наибольшем введённом значении переменной s программа
##выведет число 64. Для
##Вашего удобства программа представлена на четырёх языках программирования.

##s = int(input())
##s = s // 10
##n = 1
##while s < 51:
##    s = s + 5
##    n = n * 2
##print(n)


    
##for x in range(1,10000):
##    ##s = int(input())
##    s = x
##    s = s // 10
##    n = 1
##    while s < 51:
##        s = s + 5
##        n = n * 2
##    if n == 64:
##        print(x)




############################### ДЗЗЗЗЗ###################

## решить уравнение 2x**2 = 18 см строка 146

##Какое максимальное значение переменной s, подаваемое на вход программе,
##для которого в результате работы программы на экран будет выведено значение 64?
##Для Вашего удобства программа представлена на четырёх языках программирования.


##n = 1024
##s = int(input())
##while s >= 5:
##    s = s - 5
##    n = n // 2
##print(n)

# for x in range(100):
#         for y in range(100):
#             print(x,y)

# for a in range(100):
#     flag = True
#     for x in range(100):
#         for y in range(100):
#             if ((y + 2*x != 48) or (a < x) or (x < y)) == False:
#                 flag = False
#     if flag == True:
#         print(a)


# def f(s):
#     n = 1024
#     while s >= 5:
#        s = s - 5
#        n = n // 2
#     return n
#
#
# for i in range(500):
#     print(i, f(i))


## решить уравнение 2x**2 = 18 см строка 146

for x in range(1, 100):
    if 2*x**2 == 18:
        print(x)

###### 2х = 64

##for x in range(1,100):
##    if 2*x == 64:
##        print(x)
