##y = int(input("vvedite y = "))
##L = 0
##while y > 0:
##        L += 1
##        n = y % 10
##        y = y //10
##print(L)


##y = int(input())
##L = 0
##M = 0
##while y > 0:
##        L += 1     ## L = L + 1
##        if y % 2 == 0:
##                M = M + (y % 10) // 2
##        y = y // 10
##print(L)
##print(M)


##y = int(input())
##S = 0
##while y > 0:
##        n = y % 10
##        if n % 2 == 0:      
##                S = S + n
##        y = y //10
##print(S)


##y = int(input())
##Max = -1000000000
##while y > 0:
##        n = y % 10
##        if n > Max:
##                Max = n
##        y = y //10
##print(Max)


##y = int(input())
##k =0
##while y > 0:
##        n = y % 10
##        if n%2 == 0:
##                k = k +1
##        y = y //10
##print(k)

##y = int(input())
##p = 1
##while y > 0:
##        n = y % 10
##        if n % 3 != 0:
##                p = p * n
##        y = y //10
##print(p)

##################################30.10.21######################################

##y = 49**10+7**30-49
##k = 0
##while y > 0:
##    n = y % 7
##    if n == 6:
##        k = k + 1
##    y = y // 7
##print(k)


##y = int(input())
##for x in range(1, y + 1): ## генератор возможных делителей числа х
##    if y % x == 0: ## проверка явл. ли x дел х
##        print(x)

##y = int(input())
##for x in range(2, y): ## генератор возможных делителей числа х
##    if y % x == 0: ## проверка явл. ли x дел х
##        print(x)


##for y in range(10, 50 + 1):
##    print("делители числа ", y)
##    for x in range(2, y): ## генератор возможных делителей числа х
##        if y % x == 0: ## проверка явл. ли x дел х
##            print(x)


##y = int(input())
##k = 0
##for x in range(2, y): ## генератор возможных делителей числа х
##    if y % x == 0: ## проверка явл. ли x дел х
##        k = k + 1
########## поиск делителей завершен
##print(k)


##for y in range(10, 50 + 1):
##    k = 0
##    for x in range(2, y): ## генератор возможных делителей числа х
##        if y % x == 0: ## проверка явл. ли x дел х
##            k = k + 1
##    ########## поиск делителей для числа х завершен
##    if k == 2:
##        print(y)



##for y in range(10, 50 + 1):
##    k = 0
##    del1 = 0
##    del2 = 0
##    for x in range(2, y): ## генератор возможных делителей числа х
##        if y % x == 0: ## проверка явл. ли x дел х
##            k = k + 1
##            if k == 1:
##                del1 = x
##            if k == 2:
##                del2 = x
##    ########## поиск делителей для числа х завершен
##    if k == 2:
##        print(y,del1, del2)


##for y in range(174457, 174505 + 1):
##    k = 0
##    del1 = 0
##    del2 = 0
##    for x in range(2, y): ## генератор возможных делителей числа х
##        if y % x == 0: ## проверка явл. ли x дел х
##            k = k + 1
##            if k == 1:
##                del1 = x
##            if k == 2:
##                del2 = x
##    ########## поиск делителей для числа х завершен
##    if k == 2:
##        print(y,del1, del2)



#########################06.11.21##################################


###### 2х = 64

##for y in range(1,100):
##    if 2*y == 64:
##        print(y)

##for y in range(1,10000):
##    print(y)


##Определите, при каком наибольшем введённом значении переменной s программа
##выведет число 64. Для
##Вашего удобства программа представлена на четырёх языках программирования.

##s = int(input())
##s = s // 10
##n = 1
##while s < 51:
##    s = s + 5
##    n = n * 2
##print(n)


    
##for y in range(1,10000):
##    ##s = int(input())
##    s = y
##    s = s // 10
##    n = 1
##    while s < 51:
##        s = s + 5
##        n = n * 2
##    if n == 64:
##        print(y)




############################### ДЗЗЗЗЗ###################

## решить уравнение 2x**2 = 18 см строка 146

##Какое максимальное значение переменной s, подаваемое на вход программе,
##для которого в результате работы программы на экран будет выведено значение 64?
##Для Вашего удобства программа представлена на четырёх языках программирования.


##n = 1024
##s = int(input())
##while s >= 5:
##    s = s - 5
##    n = n // 2
##print(n)

# for y in range(100):
#         for y in range(100):
#             print(y,y)

# for a in range(100):
#     flag = True
#     for y in range(100):
#         for y in range(100):
#             if ((y + 2*y != 48) or (a < y) or (y < y)) == False:
#                 flag = False
#     if flag == True:
#         print(a)


# def f(s):
#     n = 1024
#     while s >= 5:
#        s = s - 5
#        n = n // 2
#     return n
#
#
# for x in range(500):
#     print(x, f(x))


## решить уравнение 2x**2 = 18 см строка 146

for x in range(1, 100):
    if 2*x**2 == 18:
        print(x)

###### 2х = 64

##for y in range(1,100):
##    if 2*y == 64:
##        print(y)
